zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_rtc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check the RTC pointer*/
#define NOT_RTC_VALID_POINTER(pointer)        ((void *) 0 == (pointer))           /*!< check the invalid pointer */
    
#endif

/* function declarations */
/* enable RTC bypass shadow registers function */
void rtc_bypass_shadow_enable(void);
/* disable RTC bypass shadow registers function */
void rtc_bypass_shadow_disable(void);
/* wait until RTC_TIME and RTC_DATE registers are synchronized with APB clock, and the shadow registers are updated */
ErrStatus rtc_register_sync_wait(void);

/* enable RTC alarm */
void rtc_alarm_enable(void);
/* disable RTC alarm */
ErrStatus rtc_alarm_disable(void);
/* alarm configuration functions */
/* configure RTC alarm */
void rtc_alarm_config(rtc_alarm_struct *rtc_alarm_time);
/* configure subsecond of RTC alarm */
void rtc_alarm_subsecond_config(uint32_t mask_subsecond, uint32_t subsecond);
/* get RTC alarm */
void rtc_alarm_get(rtc_alarm_struct *rtc_alarm_time);
/* get RTC alarm subsecond */
uint32_t rtc_alarm_subsecond_get(void);

/* enter RTC init mode */
ErrStatus rtc_init_mode_enter(void);
/* initialize RTC registers */
ErrStatus rtc_init(rtc_parameter_struct *rtc_initpara_struct);
/* exit RTC init mode */
void rtc_init_mode_exit(void);

/* get current time and date */
void rtc_current_time_get(rtc_parameter_struct *rtc_initpara_struct);
/* get current subsecond value */
uint32_t rtc_subsecond_get(void);

/* reset most of the RTC registers */
ErrStatus rtc_deinit(void);

/* adjust the daylight saving time by adding or substracting one hour from the current time */
void rtc_hour_adjust(uint32_t operation);
/* adjust RTC second or subsecond value of current time */
ErrStatus rtc_second_adjust(uint32_t add, uint32_t minus);

/* enable RTC reference clock detection function */
ErrStatus rtc_refclock_detection_enable(void);
/* disable RTC reference clock detection function */
ErrStatus rtc_refclock_detection_disable(void);

/* configure RTC smooth calibration */
ErrStatus rtc_smooth_calibration_config(uint32_t window, uint32_t plus, uint32_t smooth_minus);

/* timestamp and tamper configuration functions */
/* enable RTC time-stamp */
void rtc_timestamp_enable(uint32_t edge);
/* disable RTC time-stamp */
void rtc_timestamp_disable(void);
/* get RTC timestamp time and date */
void rtc_timestamp_get(rtc_timestamp_struct *rtc_timestamp);
/* get RTC time-stamp subsecond */
uint32_t rtc_timestamp_subsecond_get(void);
/* configure RTC calibration output source */
void rtc_calibration_output_config(uint32_t source);
/* configure RTC alarm output source */
void rtc_alarm_output_config(uint32_t alarm_output, uint32_t mode);
/* select the RTC output pin */
void rtc_output_pin_select(uint32_t outputpin);

/* enable specified RTC interrupt */
void rtc_interrupt_enable(rtc_interrupt_flag_enum interrupt);
/* disable specified RTC interrupt */
void rtc_interrupt_disable(rtc_interrupt_flag_enum interrupt);
/* check specified flag */
FlagStatus rtc_flag_get(rtc_flag_enum flag);
/* clear specified flag */
void rtc_flag_clear(rtc_flag_enum flag_clear);

#endif /* GD32C2X1_RTC_H */
